<?php

namespace Database\Seeders;

use App\Models\Area;
use Illuminate\Database\Seeder;

class AreaSeeder extends Seeder
{
    public function run(): void
    {
        $now = now();

        $Areas = [
            'العجمي',
            'البيطاش',
            'الهانوفيل',
            'أبو يوسف',
            'الدخيلة',
            'الورديان',
            'القباري',
            'كرموز',
            'مينا البصل',
            'اللبان',
            'المنشية',
            'محطة الرمل',
            'الشاطبي',
            'الإبراهيمية',
            'كامب شيزار',
            'الأزاريطة',
            'سبورتنج',
            'سيدي جابر',
            'كليوباترا',
            'لوران',
            'سان ستيفانو',
            'جليم',
            'رشدي',
            'زيزينيا',
            'بولكلي',
            'سابا باشا',
            'سموحة',
            'الحضرة',
            'محرم بك',
            'باكوس',
            'فلمنج',
            'العصافرة',
            'سيدي بشر',
            'ميامي',
            'المندرة',
            'المعمورة',
            'أبو قير',
            'المنتزه',
            'خورشيد',
            'العوايد',
            'الناصرية',
            'برج العرب',
            'برج العرب الجديدة',
            'العامرية',
            'النهضة',
            'كينج مريوط',
            'مرغم',
            'أبيس',
            'غيط العنب',
            'كفر عبده',
        ];

        Area::upsert(
            collect($Areas)
                ->map(fn (string $name) => [
                    'name' => $name,
                    'governorate_id' => 3,
                    'created_at' => $now,
                    'updated_at' => $now,
                ])
                ->toArray(),
            ['name'], // unique column
            ['updated_at']
        );
    }
}